## 增
- **i**     在光标所在字符前开始插入
- **I**    在光标所在行的行首开始插入 如果行首有空格则在空格之后插入
- **a**    在光标所在字符后开始插入 
- **A**    在光标所在你行的行尾开始插入
- **o**    在光标下方插入一行
- **O**    在光标上方插入一行
- **p**     重新插入已经删除的内容
## 删
- **x**    删除光标处的字符
- **dw**  删除一个单词，至下一个单词的起始处
- **de**  删除一个单词，至这个单词的末尾
- **d2w** 删除两个单词
- **dd** 删除一行
- **2dd** 删除两行
- **d$**  删除当前位置至行末的内容
## 改
- **r字符**  用输入的字符代替光标处的字符
- **R** 连续替换多个字符
- **c$** 修改当前位置至**句末**的内容
- **ce** 修改当前位置置**词末**的内容
- **s/old/new/g**  用**new**替换**old**
- **a1,a2 s/old/new/g** 在**a1**行至**a2**行之间，用**new**替换**old**
- **% s/old/new/g** 在**全文**范围内，用**new**替换**old**
- **% s/old/new/gc** 在**全文**范围内，用**new**替换**old**,并且每次替换前会有提示
## 查
- **CTRL-G**  查看当前行号
- **G** 定位到最后一行
- **gg** 定位到第一行
- **行号 G** 定位到某一行
- **/xxx** 正向查找xxx
- **?xxx**  反向查找xxx
##一些特殊命令
- **v** 进入可视化模式
- **:wq**  保存并退出
- **:set ic** 设置忽略大小写
- **:set notic** 禁用忽略大小写              


    写在最后，Vim的命令不需要死记硬背，多用几次就能记住。
